src/cf/Documents/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПрочимиКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПрочихДоходовИРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикаДоходовИРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПрочихРасчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналитикаПрочихДоходовИРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикаДоходовИРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияВнеоборотныхАктивов</Name>
					<Comment>02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеоборотныеАктивы</Name>
					<Comment>01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаСчетов</Name>
					<Comment>Служебный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторы</Name>
					<Comment>62.01, 60.02, 68.02, 71.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредства</Name>
					<Comment>50, 51, 57</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныеОбязательства</Name>
					<Comment>67</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запасы</Name>
					<Comment>10, 41</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Капитал</Name>
					<Comment>80</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КосвенныеЗатраты</Name>
					<Comment>25</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КраткосрочныеФинансовыеВложения</Name>
					<Comment>58</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторы</Name>
					<Comment>60.01, 62.02, 68.01, 70.01, 71.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитыИЗаймы</Name>
					<Comment>66</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
					<Comment>20</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НераспределеннаяПрибыль</Name>
					<Comment>84</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылиУбытки</Name>
					<Comment>99</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеВнеоборотныеАктивы</Name>
					<Comment>08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Comment>90.01</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеКраткосрочныеОбязательства</Name>
					<Comment>98</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОборотныеАктивы</Name>
					<Comment>94, 97</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Comment>91.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
					<Comment>90.07, 90.08</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервныйИДобавочныйКапитал</Name>
					<Comment>82</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
					<Comment>90.02</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТорговаяНаценка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ПрочиеРасходы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Контрагент)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РасчетыПоПрочимОперациям

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("УчетРасчетовПоПрочимОперациям", СодержанияПроводок.РасчетыПоПрочимОперациям());
	Запрос.УстановитьПараметр("КомментарийПриход", СодержанияПроводок.УвеличениеДолгаКонтрагента());
	Запрос.УстановитьПараметр("КомментарийРасход", СодержанияПроводок.УменьшениеДолгаКонтрагента());
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПрочиеРасходыРасходы.Контрагент КАК Контрагент,
	|	ПрочиеРасходыРасходы.Договор КАК Договор,
	|	ПрочиеРасходыРасходы.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ПрочиеРасходыРасходы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	&УчетРасчетовПоПрочимОперациям КАК СодержаниеПроводки,
	|	&КомментарийПриход КАК Комментарий,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.СуммаВал * КурсыВалютРасчетов.Кратность * ВременнаяТаблицаШапка.Курс /
	|		(КурсыВалютРасчетов.Курс * ВременнаяТаблицаШапка.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаВал
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени,) КАК КурсыВалютРасчетов
	|		ПО ПрочиеРасходыРасходы.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта,
	|	ВременнаяТаблицаШапка
	|ГДЕ
	|	ПрочиеРасходыРасходы.УчетПрочихРасчетов
	|	И ПрочиеРасходыРасходы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И (ПрочиеРасходыРасходы.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|	ИЛИ ПрочиеРасходыРасходы.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы))
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ПрочиеРасходыРасходы.Период,
	|	ПрочиеРасходыРасходы.Организация,
	|	ПрочиеРасходыРасходы.Контрагент,
	|	ПрочиеРасходыРасходы.Договор,
	|	ПрочиеРасходыРасходы.Договор.ВалютаРасчетов,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Контрагент.ВестиРасчетыПоЗаказам
	|			ТОГДА ПрочиеРасходыРасходы.ЗаказПокупателя
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПрочиеРасходыРасходы.СчетЗатрат,
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.СуммаВал * КурсыВалютРасчетов.Кратность * ВременнаяТаблицаШапка.Курс /
	|		(КурсыВалютРасчетов.Курс * ВременнаяТаблицаШапка.Кратность) КАК ЧИСЛО(15, 2)),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ВременнаяТаблицаШапка.Дата,
	|	ВременнаяТаблицаШапка.Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ВременнаяТаблицаШапка.Договор,
	|	ВременнаяТаблицаШапка.Договор.ВалютаРасчетов,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(ПрочиеРасходыРасходы.Сумма),
	|	&УчетРасчетовПоПрочимОперациям,
	|	&КомментарийРасход,
	|	ВременнаяТаблицаШапка.Корреспонденция,
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.СуммаВал * КурсыВалютРасчетов.Кратность * ВременнаяТаблицаШапка.Курс /
	|		(КурсыВалютРасчетов.Курс * ВременнаяТаблицаШапка.Кратность) КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени,) КАК КурсыВалютРасчетов
	|		ПО ВременнаяТаблицаШапка.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	ПрочиеРасходыРасходы.УчетПрочихРасчетов
	|	И ВременнаяТаблицаШапка.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И (ВременнаяТаблицаШапка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы)
	|	ИЛИ ВременнаяТаблицаШапка.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы))
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ВременнаяТаблицаШапка.Контрагент,
	|	ВременнаяТаблицаШапка.Организация,
	|	ВременнаяТаблицаШапка.Договор,
	|	ВременнаяТаблицаШапка.Договор.ВалютаРасчетов,
	|	ВременнаяТаблицаШапка.Дата,
	|	ВременнаяТаблицаШапка.Корреспонденция,
	|	ВЫРАЗИТЬ(ПрочиеРасходыРасходы.СуммаВал * КурсыВалютРасчетов.Кратность * ВременнаяТаблицаШапка.Курс /
	|		(КурсыВалютРасчетов.Курс * ВременнаяТаблицаШапка.Кратность) КАК ЧИСЛО(15, 2)),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПрочимиКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаРасчетыСПокупателями()

#КонецОбласти

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеРасходы.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ПрочиеРасходы.Контрагент КАК Контрагент,
	|	ПрочиеРасходы.Договор КАК Договор,
	|	ПрочиеРасходы.Корреспонденция КАК Корреспонденция,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходы.ВалютаДокумента = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаУчета
	|		ИНАЧЕ ПрочиеРасходы.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходы.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПрочиеРасходы.Кратность
	|	КОНЕЦ КАК Кратность,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходы.Курс = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПрочиеРасходы.Курс
	|	КОНЕЦ КАК Курс
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаНациональная)) КАК
	|		КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаКурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаКурсыВалютСрезПоследних.Курс = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаКурсыВалютСрезПоследних.Курс, 1)
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА ВременнаяТаблицаКурсыВалютСрезПоследних.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаКурсыВалютСрезПоследних.Кратность, 1)
	|	КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследнихСПроверкой
	|ИЗ
	|	ВременнаяТаблицаКурсыВалютСрезПоследних КАК ВременнаяТаблицаКурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Ссылка.Дата КАК Период,
	|	&Организация КАК Организация,
	|	ПрочиеРасходыРасходы.Ссылка.УчетПрочихРасчетов КАК УчетПрочихРасчетов,
	|	ПрочиеРасходыРасходы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетЗатрат,
	|	ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета КАК ТипСчета,
	|	ПрочиеРасходыРасходы.Контрагент КАК Контрагент,
	|	ПрочиеРасходыРасходы.Договор КАК Договор,
	|	ПрочиеРасходыРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПрочиеРасходыРасходы.Ссылка.Проект КАК Проект,
	|	ПрочиеРасходыРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходов КАК АналитикаПрочихДоходовИРасходов,
	|	ПрочиеРасходыРасходы.Ссылка.АналитикаПрочихДоходовИРасходов КАК АналитикаПрочихДоходовИРасходовШапка,
	|	ПрочиеРасходыРасходы.Ссылка.Корреспонденция КАК Корреспонденция,
	|	ПрочиеРасходыРасходы.Сумма КАК СуммаВал,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Ссылка.ВалютаДокумента = &ВалютаНациональная
	|			ТОГДА ПрочиеРасходыРасходы.Сумма * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс *
	|				КурсыРегВалюты.Кратность)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Сумма * ВременнаяТаблицаШапка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс *
	|			ВременнаяТаблицаШапка.Кратность)
	|	КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ПрочиеРасходыРасходы.Сумма КАК СуммаБезНДС
	|ПОМЕСТИТЬ ПрочиеРасходыПредварительно
	|ИЗ
	|	Документ.ПрочиеРасходы.Расходы КАК ПрочиеРасходыРасходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследнихСПроверкой КАК КурсыУпрВалюты
	|		ПО КурсыУпрВалюты.Валюта = &ВалютаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследнихСПроверкой КАК КурсыРегВалюты
	|		ПО КурсыРегВалюты.Валюта = &ВалютаНациональная,
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	|ГДЕ
	|	ПрочиеРасходыРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ПрочиеРасходыРасходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	|	ПрочиеРасходыРасходы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	ПрочиеРасходыРасходы.Сумма КАК СуммаБезНДС,
	|	ИСТИНА КАК ФиксированнаяСтоимость,
	|	&ПрочиеРасходы КАК СодержаниеПроводки
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|	ИЛИ ПрочиеРасходыРасходы.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|		ИНАЧЕ ПрочиеРасходыРасходы.НаправлениеДеятельности
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|		ИНАЧЕ ПрочиеРасходыРасходы.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|		ИНАЧЕ ПрочиеРасходыРасходы.Проект
	|	КОНЕЦ КАК Проект,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПрочиеРасходыРасходы.ЗаказПокупателя
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	0 КАК СуммаДоходов,
	|	ПрочиеРасходыРасходы.Сумма КАК СуммаРасходов,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	&ПрочиеРасходы КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходов КАК Аналитика
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|	ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК СуммаДоходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	ПрочиеРасходыРасходы.Корреспонденция КАК СчетУчета,
	|	&ПоступлениеДоходов КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходовШапка КАК Аналитика
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|	И ПрочиеРасходыРасходы.Сумма > 0
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.Период,
	|	ПрочиеРасходыРасходы.Организация,
	|	ПрочиеРасходыРасходы.Корреспонденция,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходовШапка,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ПрочиеРасходыРасходы.СчетЗатрат КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.Валютный
	|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.СчетЗатрат.Валютный
	|			ТОГДА ПрочиеРасходыРасходы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалДт,
	|	ПрочиеРасходыРасходы.Корреспонденция КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Корреспонденция.Валютный
	|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыРасходы.Корреспонденция.Валютный
	|			ТОГДА ПрочиеРасходыРасходы.СуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВалКт,
	|	ПрочиеРасходыРасходы.Сумма КАК Сумма,
	|	&ПрочееОприходование КАК Содержание
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы,
	|	ВременнаяТаблицаШапка
	|ГДЕ
	|	ПрочиеРасходыРасходы.Сумма > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ПрочиеРасходыРасходы.Период КАК Период,
	|	ПрочиеРасходыРасходы.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
	|	ПрочиеРасходыРасходы.Корреспонденция КАК СчетУчета,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
	|	0 КАК СуммаДоходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК СуммаРасходов,
	|	СУММА(ПрочиеРасходыРасходы.Сумма) КАК Сумма,
	|	&ПрочиеРасходы КАК СодержаниеПроводки,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходовШапка КАК Аналитика
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	(ПрочиеРасходыРасходы.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|	ИЛИ ПрочиеРасходыРасходы.Корреспонденция.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы))
	|	И ПрочиеРасходыРасходы.УчетПрочихРасчетов
	|	И ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Расходы)
	|	И ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	И ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПроцентыПоКредитам)
	|	И ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НераспределеннаяПрибыль)
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыРасходы.Период,
	|	ПрочиеРасходыРасходы.Организация,
	|	ПрочиеРасходыРасходы.Корреспонденция,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходовШапка,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыРасходы.НомерСтроки,
	|	ПрочиеРасходыРасходы.Период,
	|	ПрочиеРасходыРасходы.Организация,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка),
	|	ПрочиеРасходыРасходы.Корреспонденция,
	|	НЕОПРЕДЕЛЕНО,
	|	ПрочиеРасходыРасходы.Сумма,
	|	0,
	|	ПрочиеРасходыРасходы.Сумма,
	|	&ПоступлениеДоходов,
	|	ПрочиеРасходыРасходы.АналитикаПрочихДоходовИРасходов
	|ИЗ
	|	ПрочиеРасходыПредварительно КАК ПрочиеРасходыРасходы
	|ГДЕ
	|	ПрочиеРасходыРасходы.Корреспонденция.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Капитал)
	|	И ПрочиеРасходыРасходы.Корреспонденция.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеОборотныеАктивы)
	|	И (ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Кредиторы)
	|	ИЛИ ПрочиеРасходыРасходы.СчетЗатрат.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Дебиторы))
	|	И ПрочиеРасходыРасходы.УчетПрочихРасчетов
	|	И (ПрочиеРасходыРасходы.Корреспонденция.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|	ИЛИ ПрочиеРасходыРасходы.Сумма < 0)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПрочиеРасходы);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	Запрос.УстановитьПараметр("ВалютаНациональная", УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту());
	Запрос.УстановитьПараметр("ПрочиеРасходы", СодержанияПроводок.ОтражениеЗатрат());
	Запрос.УстановитьПараметр("ПоступлениеДоходов", СодержанияПроводок.ПрочиеДоходы());
	Запрос.УстановитьПараметр("ПрочееОприходование", СодержанияПроводок.ПрочиеЗатраты());
	Запрос.УстановитьПараметр("МоментВремени",
		Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", МассивРезультатов[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[5].Выгрузить());
	
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[6].Выгрузить());
	Иначе
		
		Выборка = МассивРезультатов[6].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", МассивРезультатов[7].Выгрузить());
	
	// Прочие расчеты
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Количество() = 0 Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", МассивРезультатов[8].Выгрузить());
	Иначе
		
		Выборка = МассивРезультатов[8].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьТаблицаРасчетыСПрочимиКонтрагентами(ДокументСсылкаПрочиеРасходы, СтруктураДополнительныеСвойства);
	// Конец Прочие расчеты
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
